{
    "metadata": {
        "source": "Michael J. Huddleston (ICT) Core Mentorships",
        "version": "1.0",
        "philosophy": "Institutional Price Action, Liquidity, and Time"
    },
    "core_concepts": {
        "PO3": {
            "full_name": "Power of 3",
            "phases": [
                "Accumulation",
                "Manipulation",
                "Distribution"
            ],
            "logic": "The daily candle opens, accumulates near the open, manipulates by reaching for liquidity (high/low), then distributes toward the true objective before closing near the opposite extreme."
        },
        "Judas_Swing": {
            "definition": "A false move used to trap retail traders and sweep liquidity before the expansion.",
            "killzone": "Specifically occurs in the first 1-2 hours of the London or NY sessions (7:00-9:00 AM EST).",
            "validation": "Must sweep a significant OLD High/Low or Asian Range High/Low followed by immediate displacement (long bodies)."
        },
        "FVG": {
            "full_name": "Fair Value Gap",
            "logic": "An imbalance where price moved too quickly, leaving only one side of the market (buy or sell) represented. Acts as a magnet for price to return and 'rebalance'.",
            "quality_check": "Institutional sponsorship is confirmed if the FVG is large and candle bodies are long."
        },
        "Order_Block": {
            "definition": "The last candle in the opposite direction before a strong impulsive move.",
            "logic": "Represent institutional buy/sell orders. Price returning to the refined 'mean threshold' (50%) of the OB sensitive level is a high-probability entry.",
            "validation": "Invalidated if candle bodies close through the 50% equilibrium level."
        },
        "SMT_Divergence": {
            "full_name": "Smart Money Tool",
            "logic": "The Trinity of Sponsorship. If DXY/TNX/ES/NQ indices are making lower lows but BTC is making a higher low, it signals institutional divergence and accumulation.",
            "rule": "Always follow the one that FAILS to make the expected move (The Leader vs. The Laggard)."
        }
    },
    "killzones_est": {
        "Asian_Range": "20:00 - 00:00 EST",
        "London_Open": "02:00 - 05:00 EST",
        "NY_Open": "07:00 - 10:00 EST",
        "London_Close": "10:00 - 12:00 EST"
    }
}